sdaiIsSubtypeOf(Sdai_instS*,Sdai_instS*)
\details
Determines whether an entity definition is a subtype of another entity definition.
\param subtype   [in] A subtype to check.
\param supertype [in] A supertype to check.
\returns sdaiTRUE if the specified entity has a type that is a subtype of the specified supertype; otherwise, the function returns sdaiFALSE.